<?php
class Enums_ArenaConfig
{
	//排行榜显示前100位玩家
	const rankListCount = 100;
	
	//对战记录显示前10条
	const arenaLogCount = 10;
	
	//名字1
    public static $RandName1 = array(
		'魁','维','凯','托利','德塔','纳沃','林沙','克汉','丽斯','黎','巫丽','黎霍','尼克','阿恩','塞活','亚','罗索','克西','彻哈域','乌',
		'顿加','奥','高地','高','奥域','瓜田','华','克巴','宾高地','巴德','亚色','米瓜','维拉','符阿','齐洛','斯拉','维尔','安拉','牙','哥卡',
		'科勒','奇默','索胡','务井','阿瑟','图西','利帕','亚尔','洛阿','坦加','法南','摩拉','夕多','内法','库伊','布斯','节沃','格马','坎',
		'印鲁','肯沃','乌列','纳来','安德','垄万','希','菲尔','利','哥戈','菲特','巴群','托卡亚','纳塔丁','里斯','科钦','巴利','斯顿','特塔里',
		'鲁澳','盟圣拉','克斯','孟雷西','曼联','贝荷','托斯','纳','曼斯','文圣','阿但','利都克','萨西登','基卡','法兰高','逊坎','布林','梅',
		'塞科','托斯','吴贝','翁哥','亚','鲁伦','纽逊','翰里','拉内','雷钦','路蒙图','厄','切马','斗','萨多','梅高地','博姆','莫合萨','塞察',
		'里群','格哈','沙本','姆斯厄','肖鸟','西雷','哥文','约肯','鲁辛','南科','拿塔','卡里','西特','南顿','留斯','隆科','诸','罗姆','亚普',
		'塔那','兹都','泰口','查林','赫尼','属波','比尔','敦卡','兹吴','拉瓜','索蒙','子弗','拉曼','亚佐','麻亚','茨哈','摩厦','法宾','卡特',
		'尤罗','安克','迪勒','万蓬','佛本','威利','拿加','西罗','阿萨','里克','尼库','俄尼','瓦松','纳丁','德墨','塔廉','梅德','塞兹','列科',
		'巴道','福圣','卢拉'
    );
    
	//名字2
    public static $RandName2 = array(
		'的','山','河','湖','海','沼','谷','丘','城','堡','港','国','洞','森','岛','村'
    );
	
	//名字3
    public static $RandName3 = array(
		'探险家','探险队','冒险队','冒险家','旅行家','旅行者','旅行队','剑术家','弓术家','法术队','丛林队','幻行者','魔旅人','赏金人','赏金队',
		'逃亡队','穿越队','穿越者','时空队','远征队'
    );
	
}